tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

brew "bat"
# brew "cmake"
brew "coreutils"
brew "fd"
brew "git"
brew "gitlab-runner"
brew "gnu-sed"
brew "gnupg"
brew "pinentry-mac"
# brew "pkg-config"
brew "postgresql", restart_service: true
brew "redis", restart_service: true
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "yarn"
brew "zsh"

cask "alacritty"
cask "docker"
cask "font-fira-code"
cask "insomnia"
cask "karabiner-elements"
cask "postico"
cask "visual-studio-code"
